# ReinEstBarLength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ReinEstBarLength Property
ParameterTypeId Class See Also
---
"Estimated Total Bar Length"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ReinEstBarLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ReinEstBarLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ReinEstBarLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace